[
  {
    "main": "Reckonsys and their experience are fundamental to our success",
    "content": "Reckonsys delivered the first version of the platform on time to exceed expectations. A committed team, they adapted features throughout the project to encourage product improvements and scalability",
    "name": "John k",
    "designation": "Co-Founder"
  },
  {
    "main": "They are very keen and have worked with many different platforms",
    "content": "The platform successfully garnered hundreds of thousands of pageviews and thousands of unique visitors after launch. Reckonsys was very good at finding forward-thinking and innovative solutions. Their team excelled at working with first-time entrepreneurs. Project management was effective",
    "name": "Margie B",
    "designation": "Founder"
  },
  {
    "main": "The Reckonsys team has integrity in what they do, and they go above and beyond to meet our needs",
    "content": "The MVP successfully displays the market-need for the specific platform. The product has received high praise on its usability and appearance. Reckonsys supplied a highly experienced, attentive, and dedicated team to accomplish the project, and they continue to provide developmental support",
    "name": "Narayan S",
    "designation": "President"
  },
  {
    "main": "Their development quality is good and their costs are low",
    "content": "Over 3,000 companies have signed up on the platform thanks to its easy-to-use and convenient interface, and investors are pleased. Reckonsys’ knowledge was essential for choosing the right architecture for the platform. Other highlights include smooth project management and responsive approach",
    "name": "Dev K",
    "designation": "Founder"
  },
  {
    "main": "They are customer-centric and are always ready to provide support during difficult situations.",
    "content": "The software enabled the company to go to market in a timely manner, meeting the expectations of the internal team. Reckonsys focuses on the needs and requirements of the client, establishing an effective collaboration. The team is hard-working, creative, and skilled.",
    "name": "Sarath S",
    "designation": "CTO"
  }
]
